LEXICON: dict[str, str] = {
    "/start": "🎉<b>N.O.T.A. parfume!</b>🎉\n"
              "Главное меню:",

    "about_us": "Масла производства заводов Швейцарии🇨🇭"
                "Франции🇫🇷, Турция🇹🇷, качества Luxe или ТОР🔝, благодаря этому парфюмерия очень стойкая и на" 
                " 99% повторяет аромат оригинального парфюма.\n"
                "- Заказать можно маленький объем для пробы от 3 мл.\n"
                "- Попробовать можно в виде чистого масла, так и в формате спрея.\n\n"
                "🚚Бесплатная доставка по городу Котовск."
                " Доставка в другие города осуществляется любой"
                " ТК или Почтой России📪 по их тарифам",

    "contacts": "Магазин <b>«N.O.T.A PARFUM»</b>"
                "находится по адресу:\n<a href='https://yandex.ru/maps/20265/kotovsk/house/pionerskaya_ulitsa_12/YEgYcg"
                "5pS0cHQFtofXl4cXxhYg==/?ll=41.499219%2C52.590026&z=16.46'> г.Котовск ,ул. Пионерская, д.12</a>\n"
                "<b>🕓Режим работы магазина:\n</b>"
                "Пн-Пт с 10:00-19:00\n"
                "Сб-Вс с 10:00-17:00\n"
                "📞 +7-(916)-937-89-89\n",
    
    "shop": "Добро пожаловать в магазин парфюмерии"
            "<b> N.O.T.A. </b>\n"
            "Выберите категорию товаров:",

    "location_mail": "Укажите индекс ближайшего почтового отделения,\t"
                     "Например:\n<b>246042</b>\n"
                     "\n<a href='https://www.google.com/maps/search/Почта+России'>Посмотреть на карте</a>",

    "location_sdek": "Укажите адрес ближайшего отделения/пастомата СДЭК\n"
                     "Например:\n<b>Каширское шоссе, д. 110,кор. 4, Москва, 115583</b>\n"
                     "\n<a href='https://www.google.com/maps/search/%D1%81%D0%B4%D1%8D%D0%BA+%D0%BF%D1%83%D0%BD%D0%B"
                     "A%D1%82%D1%8B+%D0%B2%D1%8B%D0%B4%D0%B0%D1%87%D0%B8/@55.5767509,37.4346257,11z?entry=ttu'>"
                     "Посмотреть на карте</a>",

    "contact": "Укажите свой номер телефона для того, чтоб мы могли с вами связаться и уточнить детали заказа"

}

LEXICON_USER_BTN: dict[str, str | dict] = {
    "shop": "Магазин 🛍",
    "about_us": "О нас 🎁",
    "contacts": "Контакты ☎️",
    "profile": "Профиль 🗿",
    "basket": "Корзина 🛒",
    "admin": "Администрирование 😎",
    "Instagram": "https://instagram.com/n.o.t.a_parfum?igshid=MzRlODBiNWFlZA==",
    "VK": "https://vk.com/parfum_nota",
    "Whatsapp": "https://wa.me/message/HTJESAQ366IVJ1",
    "Telegram": "https://t.me/svetlansk13"
}

LEXICON_ADMIN_BTN: dict[str, str | dict] = {
    "categories": "Категории товаров 🎏",
    "add_category": "➕ добавить категорию",
    "del_category": "➖ удалить категорию",
    "update_category": "♾ изменить категорию",

    "products": "Товар в категории 🧨",
    "add_product": "➕ добавить товар",
    "del_product": "➖ удалить товар",
    "update_product": "♾ изменить товар",
    "show_product": "➿ показать товар",
    "update_name": "изменить имя",
    "update_description": "изменить описание",
    "update_gender": "изменить гендер",
    "update_price": "изменить цену",
    "update_photo": "изменить фото",
    "update_cat": "изменить категорию",

    "dispatch": "Разослать новость 🗞",
    "user_info": "Логи ℹ️",
    "set_admin": "Добавить админа 😎",
}
